#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[33mRunning plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/dsl-2022/gh-multi-channel-message/runs/run-xtEvFKLh4oMhP2Ny[0m
[0m
Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
[0m[1mdata.archive_file.function_archive: Reading...[0m[0m
[0m[1mdata.archive_file.function_archive: Read complete after 0s [id=8f8a7a008bb59f15abf2cc2508a92c3a579290bb][0m
[0m[1mdata.local_file.schema: Reading...[0m[0m
[0m[1mdata.local_file.schema: Read complete after 0s [id=827f063a35fd52da08f6d840912e2c436a8f739b][0m
[0m[1mdata.aws_iam_policy_document.lambda_document: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.datasource_assume_role: Reading...[0m[0m
[0m[1maws_dynamodb_table.message_channel_messages: Refreshing state... [id=message-channel-messages][0m
[0m[1mdata.aws_iam_policy_document.lambda_assume_role_document: Reading...[0m[0m
[0m[1maws_appsync_graphql_api.message_channel: Refreshing state... [id=qrtb7xdnvjalhbifiyb5c57ame][0m
[0m[1maws_iam_role.ddb_resolver: Refreshing state... [id=ddb_resolver][0m
[0m[1mdata.aws_iam_policy_document.lambda_document: Read complete after 0s [id=4190579819][0m
[0m[1maws_dynamodb_table.message_channel: Refreshing state... [id=message-channel][0m
[0m[1mdata.aws_iam_policy_document.lambda_assume_role_document: Read complete after 0s [id=3693445097][0m
[0m[1mdata.aws_iam_policy_document.datasource_assume_role: Read complete after 0s [id=2027410878][0m
[0m[1maws_iam_role.lambda_role: Refreshing state... [id=test-appsync-04-09-role][0m
[0m[1maws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::212612999379:policy/terraform-20220611235900023900000001][0m
[0m[1maws_iam_role.lambda_datasource_role: Refreshing state... [id=test-appsync-04-09-appsync-lambda-datasource][0m
[0m[1maws_iam_policy_attachment.lambda_attachment: Refreshing state... [id=test-appsync-04-09-attachment][0m
[0m[1maws_iam_role_policy.ddb_resolver_policy: Refreshing state... [id=ddb_resolver:ddb_resolver_policy][0m
[0m[1maws_appsync_datasource.add_message: Refreshing state... [id=qrtb7xdnvjalhbifiyb5c57ame-add_messages][0m
[0m[1maws_appsync_datasource.get_messages: Refreshing state... [id=qrtb7xdnvjalhbifiyb5c57ame-get_messages][0m
[0m[1maws_appsync_resolver.get_all_messages_resolver: Refreshing state... [id=qrtb7xdnvjalhbifiyb5c57ame-Query-getAllMessages][0m
[0m[1maws_appsync_resolver.add_channel_message_resolver: Refreshing state... [id=qrtb7xdnvjalhbifiyb5c57ame-Mutation-createMessage][0m
[0m[1maws_appsync_datasource.add_channel: Refreshing state... [id=qrtb7xdnvjalhbifiyb5c57ame-tf_appsync_example][0m
[0m[1maws_appsync_datasource.query_channel: Refreshing state... [id=qrtb7xdnvjalhbifiyb5c57ame-query_channel][0m
[0m[1maws_appsync_resolver.add_channel_resolver: Refreshing state... [id=qrtb7xdnvjalhbifiyb5c57ame-Mutation-createChannel][0m
[0m[1maws_appsync_resolver.get_channel_resolver: Refreshing state... [id=qrtb7xdnvjalhbifiyb5c57ame-Query-getChannel][0m
[0m[1maws_appsync_resolver.get_all_channel_resolver: Refreshing state... [id=qrtb7xdnvjalhbifiyb5c57ame-Query-getAllChannels][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_lambda_event_source_mapping.ddb_lambda_event[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_lambda_event_source_mapping" "ddb_lambda_event" {
      [32m+[0m [0m[1m[0menabled[0m[0m                       = true
      [32m+[0m [0m[1m[0mevent_source_arn[0m[0m              = "arn:aws:dynamodb:us-east-1:212612999379:table/message-channel/stream/2022-06-11T23:59:00.047"
      [32m+[0m [0m[1m[0mfunction_arn[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mfunction_name[0m[0m                 = "test-appsync-04-09-ddb_stream_consumer-ts"
      [32m+[0m [0m[1m[0mid[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mlast_modified[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mlast_processing_result[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mmaximum_record_age_in_seconds[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmaximum_retry_attempts[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mparallelization_factor[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mstarting_position[0m[0m             = "TRIM_HORIZON"
      [32m+[0m [0m[1m[0mstate[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mstate_transition_reason[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0muuid[0m[0m                          = (known after apply)
    }

[1m  # aws_lambda_function.ddb_stream_consumer[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_lambda_function" "ddb_stream_consumer" {
      [32m+[0m [0m[1m[0marchitectures[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mfilename[0m[0m                       = "./dist/function.zip"
      [32m+[0m [0m[1m[0mfunction_name[0m[0m                  = "test-appsync-04-09-ddb_stream_consumer-ts"
      [32m+[0m [0m[1m[0mhandler[0m[0m                        = "index.handler"
      [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0minvoke_arn[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mlast_modified[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mmemory_size[0m[0m                    = 128
      [32m+[0m [0m[1m[0mpackage_type[0m[0m                   = "Zip"
      [32m+[0m [0m[1m[0mpublish[0m[0m                        = false
      [32m+[0m [0m[1m[0mqualified_arn[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mreserved_concurrent_executions[0m[0m = -1
      [32m+[0m [0m[1m[0mrole[0m[0m                           = "arn:aws:iam::212612999379:role/test-appsync-04-09-role"
      [32m+[0m [0m[1m[0mruntime[0m[0m                        = "nodejs16.x"
      [32m+[0m [0m[1m[0msigning_job_arn[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msigning_profile_version_arn[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0msource_code_hash[0m[0m               = "nSNXm4kexppJUyWC6DtYMgdJQedI5YVk2hRUDnR5ssE="
      [32m+[0m [0m[1m[0msource_code_size[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mtimeout[0m[0m                        = 30
      [32m+[0m [0m[1m[0mversion[0m[0m                        = (known after apply)

      [32m+[0m [0mephemeral_storage {
          [32m+[0m [0m[1m[0msize[0m[0m = (known after apply)
        }

      [32m+[0m [0mtracing_config {
          [32m+[0m [0m[1m[0mmode[0m[0m = (known after apply)
        }
    }

[0m[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
[33m│[0m [0mbut a value was found in file
[33m│[0m [0m"/home/tfc-agent/.tfc-agent/component/terraform/runs/run-xtEvFKLh4oMhP2Ny/terraform.tfvars".
[33m│[0m [0mIf you meant to use this value, add a "variable" block to the
[33m│[0m [0mconfiguration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
[33m│[0m [0mvalue was found in file
[33m│[0m [0m"/home/tfc-agent/.tfc-agent/component/terraform/runs/run-xtEvFKLh4oMhP2Ny/terraform.tfvars".
[33m│[0m [0mIf you meant to use this value, add a "variable" block to the
[33m│[0m [0mconfiguration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m

```

</details>

*Pushed by: @dsl2022, Action: `pull_request`*